{
	//==============================================================================================
	//==== C A I T R I O N A =======================================================================
	//==============================================================================================
	
	//DATING
	"Caitriona.Dialogue.Marriage.breakUp": "You-...$7#$b#...............$7#$b#...fine. I'm used to loosing what I care for anyway...$7",
	"Caitriona.Dialogue.Marriage.RejectBouquet_NotDatable": "You, uh...#$b#...no, thanks. You're kinda a weirdo...",
	"Caitriona.Dialogue.Marriage.RejectBouquet_NpcAlreadyMarried": ",,,din't take you for that type of person, @. Get lost.",
	"Caitriona.Dialogue.Marriage.RejectBouquet_VeryLowHearts": "Uh...#$b#...........$6#$b........you're still here...?",
	"Caitriona.Dialogue.Marriage.RejectBouquet_LowHearts": "Yeah, uh...I'm just gonna go.#$b#You can keep that.",
	"Caitriona.Dialogue.Marriage.RejectBouquet": "Thanks, but no thanks.$6",
	"Caitriona.Dialogue.FlowerDance_Accept": "...? You want to dance? Sure...I'm a bit rusty though...",
	"Caitriona.Dialogue.FlowerDance_Accept_Spouse": "Heh, sure. I'd love to dance with you once more.",
	"Caitriona.Dialogue.FlowerDance_Accept_Roommate": "Alright, let's dance, @.",
	
	//MARRIAGE
	"Caitriona.Dialogue.Marriage.SpouseFarmhouseClutter": "I tidied up the house a little.#$b#You got quite a lot of things here, huh. I don't kind tho.",
	"Caitriona.Dialogue.Marriage.Spouse_MonstersInHouse": "Should I get my sword? I'm gonna kill it, I tell you.#$b#Not sure where it came from but don't worry, I can defend the house while you're gone.",
	"Caitriona.Dialogue.Marriage.SpouseStardrop": "I've been meaning to give you something special that reminds me of our journey together so far...#$b#...I hope you enjoy this little gift.",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_NeedHouseUpgrade": "Sorry...I know I live on a small boat myself but...maybe if your house were bigger we won't step on each others toes?",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_NotDatable": "Uh....what?",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_NpcWithSomeoneElse": "Sorry, did I get that right?#$b#You know I'm with someone else already and you try to-...ugh, nevermind. Just get lost.",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_PlayerWithSomeoneElse": "..........#$b#...........#$b#....why are you still here? I'm trying to save your face from this emberassing display and ignored you so you can leave.",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_Under8Hearts": "Huh?#$b#Oh...I don't know...thanks but...I'm not sure I am ready for this kinda thing...",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_Under10Hearts": "Ah, um...sorry.#$b#...let's take some more time together first, okay?",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_Under10Hearts_AskedAgain": "...#$b#...I'm trying to take things slow, @. Please respect that...",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant": "....yikes. No.",
	"Caitriona.Dialogue.Marriage.SummitEvent": "...when we first met I didn't think much about where we would be in the future. Though over time when I got to know you better I realized...#$b#...I wouldn't want to be anywhere else, but here with you.$4",
	
	//DIVORCED
	"Caitriona.Dialogue.Marriage.divorced": "Get lost already. I can't believe I let myself be vulnerable around you.$7",
	"Caitriona.Dialogue.Marriage.RejectGift_Divorced": "Are you kidding me? You better take that gift and get lost before I draw my sword. The audacity...!$7",
	"Caitriona.Dialogue.Marriage.RejectMermaidPendant_Divorced": "....tsk.$7",
	"Caitriona.Dialogue.Marriage.RejectBouquet_Divorced": "You really out here doing this, huh? Why not just directly run into my sword if you're that crazy?$7",
	"Caitriona.Dialogue.Marriage.WipedMemory": "......................#$b#.....................#$b#.................#$e#...............#$b#........why are you talking to me?",
	
	//ENGAGEMENT
	"Caitriona.Dialogue.Marriage.Engagement0": "You...are proposing? ...to me?#$b#....I...oh.#$b#...sorry. This is just-...heh.#$b#Yes, I do. I can't think of anything I'd love more than to spend the rest of my life with you.",
	"Caitriona.Dialogue.Marriage.Engagement1": "...?#$b#...you really-?#$b#Yes, I do. I can't think of anything I'd love more than to spend the rest of my life with you.",
	
	//SPECIAL DATES 
	"Caitriona.Dialogue.Marriage.patio": "Nothing beats a cold one outside when the air is crisp and the sun is shining.#$b#I can get you one too, @. I brew this one myself so it's a bit strong.",
	"Caitriona.Dialogue.Marriage.spouseRoom": "....hm.#$b#...I wonder if I should get back into collecting maps.#$b#Maybe I even go out and hide some treasure, heh.",
	"Caitriona.Dialogue.Marriage.spring": "Having lived so long on an island that is constantly in summer made me appreciate the other seasons more.#$b#Spring sure is nice.#$b#Maybe I'll go out a bit and watch the birds returning...I wonder what kind of flower grow here in the wild.",
	"Caitriona.Dialogue.Marriage.spring_12": "It's the egg festival tomorrow, right? You wanna go and partake in the hunt? I'll stay and keep the farm running while you're gone.",
	"Caitriona.Dialogue.Marriage.spring_23": "Tomorrow is the flower dance, wanna make the others envious and have some fun?#$b#We could also just stay home if you want.",
	"Caitriona.Dialogue.Marriage.summer_10": "The luau is coming up, right? Did you decide what to put in yet?#$b#Maybe some smoked fish-...nono, I'll let you decide for yourself.",
	"Caitriona.Dialogue.Marriage.summer": "Summer is a great season. I do enjoy being out and about a lot when the weather is nice and nothing is better than to have a cold one out in the sun now and again to quench your thirst.",
	"Caitriona.Dialogue.Marriage.summer_27": "Watching the jellies migrate is nice. Nothing beats being on the ship out in the ocean watching them surround you in the dark of the night though.#$b#Will you attend? I'll warm up the bed for you while you're gone.",
	"Caitriona.Dialogue.Marriage.fall": "The season where everything feels fleeting...#$b#...not too sure if I like it or not.#$b#The thought of cozying up when it gets colder does sound nice though...",
	"Caitriona.Dialogue.Marriage.fall_Tue": "I think....I can enjoy fall. While it's a seson of change...it can also be good change.#$b#It makes me remember when you came into my life.",
	"Caitriona.Dialogue.Marriage.fall_Wed": "I think I will go out a bit and rake the leaves. Maybe even see if I can find some hazelnuts to roast.",
	"Caitriona.Dialogue.Marriage.fall_15": "The fairs in again tomorrow, right?#$b#You think you will win the contest? I might go and see what that's all about...",
	"Caitriona.Dialogue.Marriage.fall_26": "I'm not afraid of no ghosts...#$b#...things can get pretty spooky out in the dark when you're on a ship though.#$b#Don't worry, enjoy the festivities. I have my trusty sword in case something happens.",
	"Caitriona.Dialogue.Marriage.winter": "Winter...I'm not too fond of the snow.#$b#The times you can snuggle up inside and enjoy some mulled wine does outweight my dilike for the season by far though.",
	"Caitriona.Dialogue.Marriage.winter_7": "Do you want to build a snowman?#$b#...or maybe ice sculpture would be more fitting, hm...",
	"Caitriona.Dialogue.Marriage.winter_24": "Have you gotten your secret gift ready? don't forget to pick it up when you go to town tomorrow.#$b#Heh, all I personally want this year is simply being with you, @.",
	"Caitriona.Dialogue.Marriage.winter_28": "Winter is almost over...have you readied yourself for a new year of farming yet?",
	
	//GENERIC DIALOGUE
	"Caitriona.Dialogue.Marriage.Rainy_Day_0": "It's been rather bad out there today. Be sure to put on something to not get drenched.#$b#Here, this'll warm you up just in case. [395]",
	"Caitriona.Dialogue.Marriage.Rainy_Day_1": "It might be bad outside when it comes to the weather but as long as you're here with me I wouldn't mind being out there in the rain.#$b#Heh, running through puddles and getting all muddy might be childish but it sure sounds like a fun activity together.",
	"Caitriona.Dialogue.Marriage.Rainy_Day_2": "Oh, I might be taking %pet for a little scrub.#$b#Since it's raining taking a bath sounds like a nice thing to do. Don't you think?",
	"Caitriona.Dialogue.Marriage.Rainy_Day_3": "Rainy days are different here in the valley. Out on the island they can be pretty intense...out on the ocean even worse.#$b#Not that I am complaining. It's a pleasant surprise.",
	"Caitriona.Dialogue.Marriage.Rainy_Day_4": "I hope it's storming today. Then I've a good excuse to get out the thick blankets and sit at the fireplace with you, heh.#$b#Here, this'll warm you up just in case. [395]",
	"Caitriona.Dialogue.Marriage.Rainy_Day_5": "Sometimes when it's rainy like this it feels like something is calling me.#$b#...maybe it's the yearning for the unknown, the wild rides on the waves...",
	"Caitriona.Dialogue.Marriage.Rainy_Day_6": "It's raining again, huh...#$b#...you wanna go out and get all muddy? Then we can take a bath together right after.",
	"Caitriona.Dialogue.Marriage.Rainy_Day": "It's raining again...maybe I will go and smoke some fish for the colder season today.",
	"Caitriona.Dialogue.Marriage.Rainy_Night_0": "You were out and about all day in the rain, huh? Good thing I heated up the bed already.#$b#Let's get you out of these clothes...",
	"Caitriona.Dialogue.Marriage.Rainy_Night_1": "Soaking wet?#$b#Come here, I'll get you a hot bath ready and then we can slip under the covers and warm each other up.",
	"Caitriona.Dialogue.Marriage.Rainy_Night_2": "Heh, I got quite a lot done today. My map collection is making some good progress, you see.#$b#Maybe there's something else we could progress on tonight as well, @?",
	"Caitriona.Dialogue.Marriage.Rainy_Night_3": "I don't mind being stuck inside all day, especially if it's with you.#$b#hearing the raindrops pitter patter on the roof is pretty relaxing.",
	"Caitriona.Dialogue.Marriage.Rainy_Night_4": "How about you slip into something more comfortable while I clean up the last few things?#$b#If you want I can make you some hearty soup to warm you up from the inside.",
	"Caitriona.Dialogue.Marriage.Rainy_Night_5": "I've set up some barrels to catch the rain. Easy way to freely water the crops.#$b#Plus, the sound of the abrrels filling up is nice to fall asleep to to be honest.",
	"Caitriona.Dialogue.Marriage.Rainy_Night_6": "What better time to huddle up together to fall asleep in bed than a rainy night?",
	"Caitriona.Dialogue.Marriage.Rainy_Night": "If I were on my boat right now I'*d think about checking all possibilities of leaks.#$b#...now that I am here with you I can't wait to fall asleep in bed with you.",
	"Caitriona.Dialogue.Marriage.Indoor_Day_0": "Hey there, @. Got something for you that I whipped up real quick. Don't overwork yourself, okay? 241",
	"Caitriona.Dialogue.Marriage.Indoor_Day_1": "I might stay indoors today and spend my time analyzing the maps I have gotten this week.#$b#I could possibly mark down new routes to explore...",
	"Caitriona.Dialogue.Marriage.Indoor_Day_2": "Go out and defeat all your enemies, @.#$b#I will go and check some old books about sea routes later. Here, have one to-go. [395]",
	"Caitriona.Dialogue.Marriage.Indoor_Day_3": "I really want you to stay home with me today but I know you got quite a lot on your plate.#$b#When you come home let's spend some time together, okay?",
	"Caitriona.Dialogue.Marriage.Indoor_Day_4": "Good day, @.#$b# I might go out and meet up with some new friends I made in the pirate cove. Hope you're having a great day yourself.",
	"Caitriona.Dialogue.Marriage.Indoor_Day_5": "Got much to do today. What about you?#$b#Here, let me help you out getting some energy in with this. [253]",
	"Caitriona.Dialogue.Marriage.Indoor_Night_0": "Welcome home, @. Hope you had an interesting day.#$b#I've been thinking all day about you....#$b#...#$b#...would you like to come to bed with me?",
	"Caitriona.Dialogue.Marriage.Indoor_Night_1": "I've cleaned up and tidied the house today while you were gone. Funnily enough I found one of my daggers that I thought I had lost.",
	"Caitriona.Dialogue.Marriage.Indoor_Night_2": "Maybe it's just a habit of mine but I made sure to check our stock so we are not running out of anything.#$b#Now the only thing left is to check up on my spouse, heh.#$b#Need a snack or maybe a massage?",
	"Caitriona.Dialogue.Marriage.Indoor_Night_3": "You think we can do some night stroll one of these days? I always liked standing at the pier when it's dark and having a cold one...",
	"Caitriona.Dialogue.Marriage.Indoor_Night_4": "How about we go to bed early today and I'll show you what I've found out about old sea routes yesterday?",
	"Caitriona.Dialogue.Marriage.Indoor_Night_5": "I've come to like the farming life here. Just last week I told my friends at the cove to try and do some farming so they get more vitamins in their diet while out on the sea.#$b#Didn't think all your talk about preserving vegetables and fruits would come in handy this soon, heh.",
	"Caitriona.Dialogue.Marriage.Indoor_Night_6": "I've ran after %pet all day today. I can feel all the muscles in my body...#$b#...why don't we have some hot bath together to wind down, @?",
	"Caitriona.Dialogue.Marriage.Outdoor_0": "I noted down a few things that need fixing. I am a jack of all trades but I can admit when it's out of my range of talents.#$b#I'll see if I can ask Robin later to see how to fix them, don't worry.",
	"Caitriona.Dialogue.Marriage.Outdoor_1": "Got up early today to check on the animals. Everything is still working as it should, heh.#$b#Maybe I'll take %pet on a stroll later.",
	"Caitriona.Dialogue.Marriage.Outdoor_2": "Things can get pretty tough out on the farm, right?#$b#Make sure to take a break if things get too exhausting. I'll go and make you some hearty meal to restore your energy.",
	"Caitriona.Dialogue.Marriage.Outdoor_3": "I've been thinking...do you think I should take up another hobby?#$b#I quite enjoy cartography...and talking to Gunther at the museum let me discover quite a few interesting historical facts about certain maps.",
	"Caitriona.Dialogue.Marriage.Outdoor_4": "The sun is out, the sky is bright...#$b#...but nothing fills me more with joy than to look at you.",
	"Caitriona.Dialogue.Marriage.Outdoor": "Have a lovely day, @...I will go and take %pet out for a stroll and maybe go down to the pier.",
	"Caitriona.Dialogue.Marriage.OneKid_0": "I went out with %kid1 and %pet earlier. There was a lot of mud and grass involved...#$b#...reminds me of the times we always went out in the rain to jump around in the mud, heh.",
	"Caitriona.Dialogue.Marriage.OneKid_1": "I've shown %kid1 some of my maps today. Later I got some of the most colorful and creative freshly drawn maps from %kid and hung them up on the fridge.#$b#I think we got a little pirate in the making, heh.",
	"Caitriona.Dialogue.Marriage.OneKid_2": "I am really glad that I am used to few hours of sleep from sailing the seas.#$b#Having a kid is a lot of work afterall. It's worth it though, all those sleepless nights, heh.",
	"Caitriona.Dialogue.Marriage.OneKid_3": "Do you think %kid1 will be fine?#$b#I'm always worried if I do things right...it's not like I had a good role model to know what I should do...",
	"Caitriona.Dialogue.Marriage.OneKid_4": "Today %kid1 came to me and asked if there will be any siblings, heh.#$b#...I don't know, what do you think? A big family does sound nice...",
	"Caitriona.Dialogue.Marriage.TwoKids_0": "You know...having two kids made me think back to the times I had my crew.#$b#...there's a lot of yelling, broken things and me trying to fix everything.#$b#...but this is way better because I also have you and can hug away any stress, heh.",
	"Caitriona.Dialogue.Marriage.TwoKids_1": "I'm going to take %kid1 and %kid2 out today. We will stop at the museum and I will show them some old maps Gunther told me about.#$b#Maybe even stop and buy them a little treat if they behave, heh.#$b#When you come back home later I will have a treat for you as well, @.",
	"Caitriona.Dialogue.Marriage.TwoKids_2": "%kid2 came to me today and told me a secret. Then %kid1 came to me telling me the same secret.#$b#Hm? What secret was it? Oh, I can't tell you that.#$b#It was funny to watch though...heh. I've got a little secret for you too...#$b#...I love you as much as the sea loves the shore, @.",
	"Caitriona.Dialogue.Marriage.TwoKids_3": "%kid2 asked me today about becoming a pirate means you can't be a farmer too.#$b#Naturally I told %kid2 that you can be a farming pirate or a pirating farmer.#$b#What would that entail? ...farming on a ship or...having a ship on the farm....who knows....children have such fantastic ideas, heh.",
	"Caitriona.Dialogue.Marriage.TwoKids_4": "%kid1 and %kid2 asked me if they can go to the sewer...do you know why they may ask that?#$b#There was some mention about weird noises and monsters...should I get my sword?",
	"Caitriona.Dialogue.Marriage.NoBed_0": "@...where did the bed go?",
	"Caitriona.Dialogue.Marriage.NoBed_1": "...I am used to sleeping in uncomfortable palces but...where did the bed go?",
	"Caitriona.Dialogue.Marriage.NoBed_2": "Huh...could've sworn there was a bed here.",
	"Caitriona.Dialogue.Marriage.NoBed_3": "...not really a great night without any bed around.",
	
	//AFFECTION DIALOGUE
	"Caitriona.Dialogue.Marriage.Good_0": "I actually went ahead and  started my work on some map coordinates. I think my knowledge of the surrounding sea really helps me out.#$b#Thank you for always being there for me, @.#$b#Without you I'd probably still just waste away doing nothing on my boat...#$b#I love you, @.$4",
	"Caitriona.Dialogue.Marriage.Good_1": "I think the farm life is really growing on me.#$b#We're a great team, @.#$b#Mqaybe I will let you in on my secret where I hid all my treasure one day, heh.",
	"Caitriona.Dialogue.Marriage.Good_2": "Thank you for always being there to catch me when I fall, @.#$b#I hope that you can say the same about me, heh.#$b#Tonight I will cook you your favorite meal.",
	"Caitriona.Dialogue.Marriage.Good_3": "I went to the store today.#$b#The people in this town are really lovely. I forgot my wallet at home and they helped me out without any question. It's a really tight-knit community.",
	"Caitriona.Dialogue.Marriage.Good_4": "Do you think we could go out and gaze at the stars tonight?#$b#I'd love to just lay on the ground and count them with you...just like the stars in the sky...#$b#...my love for you is endless.",
	"Caitriona.Dialogue.Marriage.Good_5": "I love you, @.#$b#I hope that the time we can spend together is long and filled with joy.",
	"Caitriona.Dialogue.Marriage.Good_6": "I woke up early today to tidy up the house and take a walk with %pet.#$b#Have a great day, @. Let's snuggle up later in bed and tell each other how our day was.",
	"Caitriona.Dialogue.Marriage.Good_7": "Gunther told me the other day that I could make a book with all my knowledge and information I have gathered about the sea routes and such in the past.#$b#I might take him up on his offer of helping me with it.",
	"Caitriona.Dialogue.Marriage.Good_8": "Do you think we could go down to the shore together today? I'd love to collect some shells and such and just...#$b#...oh, do I really need a reson? I really just want to go out with you, heh.",
	"Caitriona.Dialogue.Marriage.Good_9": "I've had sucha good sleep last night. I woke up and felt full of energy, can you believe it?#$b#I went ahead and made some breakfast for you. [211 350 210]",
	"Caitriona.Dialogue.Marriage.Neutral_0": "Good morning, @. [395]#$b#Have some coffee for a great start into the day. I will take care of the farm today, so go out and have some fun.",
	"Caitriona.Dialogue.Marriage.Neutral_1": "I saw the kids earlier today. They were walking around with Miss Penny.#$b#They asked me if I was a real pirate, heh.",
	"Caitriona.Dialogue.Marriage.Neutral_2": "%Caitriona seems a little distracted right now.#$b#Oh...hey, @. Sorry...I was thinking about maps.",
	"Caitriona.Dialogue.Marriage.Neutral_3": "Good morning, @.[595]#$b#Have this flower as a token of my love to you, heh.",
	"Caitriona.Dialogue.Marriage.Neutral_4": "I was thinking of taking the boat to Ginger Island today. Maybe I will go and see how things are going there.",
	"Caitriona.Dialogue.Marriage.Neutral_5": "I think I am going to go to the museum today. Gunther wanted to take a look on what I have written so far on some of the smaller island in the Gem Sea.",
	"Caitriona.Dialogue.Marriage.Neutral_6": "I'm gonna spend quite some time studying maps today.#$b#I think these will surely help someone out there, even if it's just to read about what island and such are out there.",
	"Caitriona.Dialogue.Marriage.Neutral_7": "It's good to see you, @.#$b#The wind told me today thatyou're thecutest thing around and I have to agree.#$b#Heh, I admit, that was bad. I tried flirting a little but I don't think that's for me.",
	"Caitriona.Dialogue.Marriage.Neutral_8": "Wanna jump around in the mud today?",
	"Caitriona.Dialogue.Marriage.Bad_0": "I-...just.....$1#$b#...@.#$b#Not...today... It's not a good day for me.$7#$b#...maybe I will feel better later...$1",
	"Caitriona.Dialogue.Marriage.Bad_1": "Sorry...no.#$Today is...one of my former crewmates birthday. It's...still hard sometimes...$7",
	"Caitriona.Dialogue.Marriage.Bad_2": "%Caitriona seems rather distracted, she doesn't notice you at all...",
	"Caitriona.Dialogue.Marriage.Bad_3": "You...ugh.#$b#No...not today...the storm is-...$7#$b#%Caitriona does not respond to you...",
	"Caitriona.Dialogue.Marriage.Bad_4": "..........$1#$b#Sorry....I'm sorry...$7#$b#...coffee. You want...coffee, right...?[395]",
	"Caitriona.Dialogue.Marriage.Bad_5": "Ugh...hey...I think...$1#$b#...I think I'm gonna stay home today, @...$7",
	"Caitriona.Dialogue.Marriage.Bad_6": "No good...sorry.#$b#I think...I will stay in bed today...my heart just...aches...$7",
	"Caitriona.Dialogue.Marriage.Bad_7": "........$7#$b#$Caitriona turns away covering her face.",
	"Caitriona.Dialogue.Marriage.Bad_8": "Do you think...we will stay together...? I love you, @...#$b#Sorry...I just-...I don't know.$1",
	
	//==============================================================================================
	//==== B A R N A B A S =========================================================================
	//==============================================================================================
	
	//DATING
	"Barnabas.Dialogue.Marriage.breakUp": "......huh?!$7#$b#You-...$2#$b#...but why...$8",
	"Barnabas.Dialogue.Marriage.RejectBouquet_NotDatable": "Um, what'cha got there?",
	"Barnabas.Dialogue.Marriage.RejectBouquet_NpcAlreadyMarried": "Uh, huh....I don't get it.",
	"Barnabas.Dialogue.Marriage.RejectBouquet_VeryLowHearts": "Hm. Who's the lucky person, @?",
	"Barnabas.Dialogue.Marriage.RejectBouquet_LowHearts": "Uhhhhh, nice flowers you got there.",
	"Barnabas.Dialogue.Marriage.RejectBouquet": "I think you're mistaking me with someone.",
	"Barnabas.Dialogue.Marriage.SummitEvent": "...I never thought we'd be where we are now. Thanks to your support I was able to grow as a person and believe in myself.#$b#I hope that we will have a lot of happy and exciting years!$1",
	"Barnabas.Dialogue.FlowerDance_Accept": "You want to dance? Sure, I'd love to!$1",
	"Barnabas.Dialogue.FlowerDance_Accept_Spouse": "Yay, let's dance again, @!$1",
	"Barnabas.Dialogue.FlowerDance_Accept_Roommate": "Alright, let's dance, @1",
	
	//MARRIAGE
	"Barnabas.Dialogue.Marriage.SpouseFarmhouseClutter": "Hehe, I made a mess! You made a mess!#$b#Let's clean it all up now, @!$1",
	"Barnabas.Dialogue.Marriage.Spouse_MonstersInHouse": "Oh! Lemme handle this, I got a good bite! Let it be on land or in water I know how to take them on!$1",
	"Barnabas.Dialogue.Marriage.SpouseStardrop": "I love you, @!$1#$b#I think tomorrow I gonna love you even more! Here, have this so you know how much you mean to me!$1",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_NeedHouseUpgrade": "Aw, man...I'm kinda big. I think you need a bigger house before I can think about this...$2#$b#I don't wanna accidentally squish you!",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_NotDatable": "Um....okay?",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_NpcWithSomeoneElse": "I don't think you know what you're doing, @...",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_PlayerWithSomeoneElse": "I'm sorry...what?$6",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_Under8Hearts": "Hmmm, mhm.......I do really like you, @ but...I don't know...I'm not really good in this kinda thing...$7",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_Under10Hearts": "Oh, hm...maybe...not...yet...$8",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_Under10Hearts_AskedAgain": "Can you please...not...$8",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant": ".....sigh....I just....I don't know....$8",
	
	//DIVORCED
	"Barnabas.Dialogue.Marriage.divorced": "Ugh...why-...I don't wanna see you anymore...how can you do this to me...I really loved you....$8",
	"Barnabas.Dialogue.Marriage.RejectGift_Divorced": "Pfft!$5#$b#......$7#$b#.....can you not?$8",
	"Barnabas.Dialogue.Marriage.RejectMermaidPendant_Divorced": "Is this....some sick game for you...?$2",
	"Barnabas.Dialogue.Marriage.RejectBouquet_Divorced": "Leave me alone....$2",
	"Barnabas.Dialogue.Marriage.WipedMemory": "Hey there, I'm Barnabas-!#$b#.....hm. Somehow I feel like...oh nevermind!",
	
	//ENGAGEMENT
	"Barnabas.Dialogue.Marriage.Engagement0": "Gasp!$2#$b#I do! Oh my-! @!#$b#I really really wanna! Yessss!$1",
	"Barnabas.Dialogue.Marriage.Engagement1": "Hehehehe!$1#$b#Oh! I do! Oh man, oh man! I gotta tell Calliope!",
	
	//SPECIAL DATES 
	"Barnabas.Dialogue.Marriage.patio": "I think it's about time I make some new furniture! I love wood working! and smithing! And and!",
	"Barnabas.Dialogue.Marriage.spouseRoom": "Hehe! I was told my sketches are rather messy but I always measure right!#$b#There's just something really exciting when I get to build something new!",
	"Barnabas.Dialogue.Marriage.spring": "I love spring! When the flowers finally grow again and the bees get active...oh!#$b#I wanna run around and see how many diferent kinds of flowers I can find this early on!$1",
	"Barnabas.Dialogue.Marriage.spring_12": "I don't quite get the egg festival...but I do like eggs!$1#$b#Do you think someone one day was just looking at eggs and thought they're so neat they deserve a festival?#$b#Or maybe it's because of the protein....who knows! But it's exciting to think about! I hope you win tomorrow!",
	"Barnabas.Dialogue.Marriage.spring_23": "Oh! The flower dance! I really wanna dance, @!#$b#I think I figured out the dance now! If all fails I can still twirl around, right?$1",
	"Barnabas.Dialogue.Marriage.summer_10": "Hm! How about we put a sardine into the pot? Or maybe....a diamond! Oh! A prismatic shard is tasty too!$1#$b#....hm? We can't put in gems? Oh...well, then I just save them for ourselves![74]",
	"Barnabas.Dialogue.Marriage.summer": "Maybe it's because I grew up in a tropical climate but I love summer!$1#$b#Everything is bright and full of life and I get to run around and just have fun!",
	"Barnabas.Dialogue.Marriage.summer_27": "If you want I can always call on some jellies to have a fun night, @!#$b#I'll let you enjoy it with the townsfolk but jsut let me know if I should introduce you to some jellies!$1",
	"Barnabas.Dialogue.Marriage.fall": "Fall! Fall! Oh, can I go and rake the leaves on the farm? I really wanna jump into the piles with %pet!$1",
	"Barnabas.Dialogue.Marriage.fall_Tue": "Hey hey! Did I tell you that I love you today yet? I love you, @!$1#$b#Lemme give you a big smooch and shower you with love!$1",
	"Barnabas.Dialogue.Marriage.fall_Wed": "I'm gonna go and fetch the biggest pumpkins around so we can cut faces into them!$1#$b#Let's decorate the whole valley with them!",
	"Barnabas.Dialogue.Marriage.fall_15": "Excited for tomorrow yet? I talked to Alex today about the fair and he told me I'd be great friends with the strongman! A test of strength...should I try it out?",
	"Barnabas.Dialogue.Marriage.fall_26": "Ghosts are pretty fun sometimes! I've seen my fair share of them on the island...#$b#...will you put on a costume tomorrow? I wanna see what you will go as!$1",
	"Barnabas.Dialogue.Marriage.winter": "It snows here a lot, right? I really want to build a snowman, and maybe and igloo...#$b#...could also build a castle or...why stop just there? Hmmmmm!",
	"Barnabas.Dialogue.Marriage.winter_7": "I can't wait to see how many fish you will catch tomorrow!$1#$b#Don't worry, I will warm up the bed for you so go and have fun!$1",
	"Barnabas.Dialogue.Marriage.winter_24": "This gift giving tradition is a nice idea! Do you think we should do that at home as well? I love making things for others!$1",
	"Barnabas.Dialogue.Marriage.winter_28": "A new year approaches!$1#$b#Hey hey! I think I got a really great idea to tidy up the farm real fast, hehe!$1",
	
	//GENERIC DIALOGUE
	"Barnabas.Dialogue.Marriage.Rainy_Day_0": "I love when it rains! The pitter patter sound on this roof is especially nice to listen to.$1#$b#Maybe I will take %pet and run around, hehehe!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Day_1": "Standing in the rain is kinda like going for a swim.#$b#Okay, it's not that comparable...but I still like it!$1#$b#I'm gonna have a hot bath ready for you when you get home!",
	"Barnabas.Dialogue.Marriage.Rainy_Day_2": "Wanna run around in the rain? We could catch frogs and watch them hop around!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Day_3": "Oh, I can't wait to go outside! I really wanna run around in the rain!#$b#It's also a good time to make sure we collect enough rainwater, jsut in case!",
	"Barnabas.Dialogue.Marriage.Rainy_Day_4": "You wanna have a hot bath together later? We can eat soup and snuggle up in bed!$1#$b#If you want you can be the big spoon!",
	"Barnabas.Dialogue.Marriage.Rainy_Day_5": "Rain!$1#$b#Let's go! Here have this to warm you up![218]",
	"Barnabas.Dialogue.Marriage.Rainy_Day_6": "I will cook something that will warm you up today! Be sure to not overwork yourself, @! I'm gonna bearhug you for the rest of the day otherwise!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Day": "A lovely day! If you don't wanna go out in the rain I can take care of the farm for you!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Night_0": "Oh, the sound of the rain is really relaxing! I love it!#$b#Here, have some soup to warm you up, @![236]#$b#I wanna make sure you stay healthy and warm. Don't hesitate to come to me if you feel sick!",
	"Barnabas.Dialogue.Marriage.Rainy_Night_1": "Wanna call it a day and go to bed? My arms are screaming for a hug!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Night_2": "I've made sure our bed is still sturdy and all screws are tight!#$b#Oh, I just did that um, just cause!$1#$b#What do you think I was doing it for?",
	"Barnabas.Dialogue.Marriage.Rainy_Night_3": "Today I watched some frogs hop around and have a little dance. They looked pretty serious in their little world.#$b#I think I wanna dance sometimes too? Would you like to dance with me?",
	"Barnabas.Dialogue.Marriage.Rainy_Night_4": "I helped fix some furniture at the store today. I even got a nice warm tea from Caroline, can you believe it?#%b#I would've done it without the tea too, but it was surely delicious!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Night_5": "Hey hey!$1#$b#Did you ever have a midnight swim in the rain? It's a great expirience!$1",
	"Barnabas.Dialogue.Marriage.Rainy_Night_6": "I helped Robin getting a bunch of trees to her house today! She said she was needing some new stash so I went and just got her a few trees.#$b#She said something bout a year worth of supplies but I think it wasn't that much. I help where I can!",
	"Barnabas.Dialogue.Marriage.Rainy_Night": "Hot bath? Check! Making a batch of delicious soup? Check! Oh!#$b#@....there is a really serious lack of you on my list! Let me give you a big smooch!$1",
	"Barnabas.Dialogue.Marriage.Indoor_Day_0": "I think I'm gonna stay home today. I got some cool books to read from Gunther!$1",
	"Barnabas.Dialogue.Marriage.Indoor_Day_1": "The house need some light repairs, I think that'll be my plan for today, @. Go out and have some fun, I'll be here when you get home, hehe!$!",
	"Barnabas.Dialogue.Marriage.Indoor_Day_2": "Oh, I'm so happy!#$b#I think I just discovered the floors are creaking!#$b#Now I can spend my time checking them out and maybe applying some new varnish too, hehe!",
	"Barnabas.Dialogue.Marriage.Indoor_Day_3": "Hmmmmm, I think...I gonna make some wooden toys today. Do you believe the kids will like them?",
	"Barnabas.Dialogue.Marriage.Indoor_Day_4": "@, my friend, my love, my everything...#$b#...I swear I did not mean to bite down on the fork that hard. I totally gonna get a new one!",
	"Barnabas.Dialogue.Marriage.Indoor_Day_5": "Hm, I gathered a handful of ore samples earlier today. I asked the blacksmith for some too.#$b#When I licked one he handed me he gave me a weird look, I wonder why...",
	"Barnabas.Dialogue.Marriage.Indoor_Night_0": "Hey, you know that I love you, right?#$b#Here, I made this for you today.[527]",
	"Barnabas.Dialogue.Marriage.Indoor_Night_1": "I think I ate too much ore today...#$b# It was just a few chunks but now I need to collect more if I want to work on my latest project.$2",
	"Barnabas.Dialogue.Marriage.Indoor_Night_2": "What do you want to do tomorrow?#$b#I could pack you a lunch if it's something that requires you to be out all day.",
	"Barnabas.Dialogue.Marriage.Indoor_Night_3": "Come here!$1#$b#I missed you so much, I wanna smooch you all over!$1",
	"Barnabas.Dialogue.Marriage.Indoor_Night_4": "I took a quick swim back to the island today. Nothing beats an eventful day than running around the island to fix a few things, hehe!",
	"Barnabas.Dialogue.Marriage.Indoor_Night_5": "Welcome home! Let's go get a bath and hop into bed!$1",
	"Barnabas.Dialogue.Marriage.Indoor_Night_6": "How was your day today? I crushed some boulders on the farm that were in the way!I also threw one down the mountain to watch it roll down.",
	"Barnabas.Dialogue.Marriage.Outdoor_0": "I'm gonna haul some trees around today!#$b#There's a few ideas I have in mind for something...maybe I will show you later!$1",
	"Barnabas.Dialogue.Marriage.Outdoor_1": "What a lovely day outside! I can't wait to run around and see what what the day has in store for me!$1#$b#Maybe I will find some neat driftwood that I can use for a project.",
	"Barnabas.Dialogue.Marriage.Outdoor_2": "Do you smell that? That smelly smell that smells like-....wait.#$b#...#$b#...nevermind that was just the smell of the blood in the clinic. False alarm.",
	"Barnabas.Dialogue.Marriage.Outdoor_3": "I am gonna go wild today! A few boulders here, some tree stumps there...I really wanna tear out a few things...hm...what should I do if I stiull have so much energy when we go to bed later?",
	"Barnabas.Dialogue.Marriage.Outdoor_4": "@!$1#$b#Let's have a pillow fight later!$1",
	"Barnabas.Dialogue.Marriage.Outdoor": "I really love being on the farm!#$b#You've achieve quite a bit here, I am so impressed!#$b#Don't worry, I will help out where I can!",
	"Barnabas.Dialogue.Marriage.OneKid_0": "I've never thought it's so much fun to have a kid!$1#$b#I don't mind staying up all night so go get your needed sleep!#$b#This little fella will take care of everything!",
	"Barnabas.Dialogue.Marriage.OneKid_1": "%kid1 asked me today for swimming lessons. They grow up so fast!#$b#Don't worry, I already checked, %kid1 got everything needed to breathe underwater.",
	"Barnabas.Dialogue.Marriage.OneKid_2": "Today I'm gonna take %kid1 and show how I punch rocks!$1#$b#Just some days ago %kid1 ate one of my ores...sorry, I think that appetite comes from me.",
	"Barnabas.Dialogue.Marriage.OneKid_3": "I saw %kid1 lift a stump today!#$b#I am so proud!$2#$b#Soon enough %kid1 gonna lift a boulder, hehe!",
	"Barnabas.Dialogue.Marriage.OneKid_4": "I've raised my sister on my own so I think I'm pretty good at this.#$b#I know %kid1 would love to eat scrap metal all day but of course it's important to eat properly.",
	"Barnabas.Dialogue.Marriage.TwoKids_0": "Good thing I got two arms.#$b#I ran after %kid1 and %kid2 earlier when they didn't want to eat their veggies.#$b#My legs are longer so of course I caught them quickly.",
	"Barnabas.Dialogue.Marriage.TwoKids_1": "I think I can handle both of the kids so don't worry if you're out and about all day!$1#$b#I'm gonna take them to the beach to collect mussels and clams!",
	"Barnabas.Dialogue.Marriage.TwoKids_2": "So, I was sitting in the living room with %kid2 showing some ores I collected.#$b#In comes %kid1 with a skateboard and shoots across the room, one of the ores getting stuck between the wheels resulting in %kid1 flying right towards the-...#$b#...hm, maybe I should leave that detail out.#$b#Anyway, you've never seen me shoot up this fast to catch a flying child.",
	"Barnabas.Dialogue.Marriage.TwoKids_3": "Alright, I think I got this figured out...#$b#...first I catch %kid1 and run around the farm and then grab %kid2 and sprint into the forest before it hits noon.#$b#Then I go to town and grab some oil and flour from the store while juggling the kids around and, uh-...#$b#....wait where was I going with this again?",
	"Barnabas.Dialogue.Marriage.TwoKids_4": "I think today I gonna ask Gunther if the kids can stay in the museum. They really wanted to read about a few things, then I can drop by the blacksmith and ask about a fresh drop of ores, maybe...",
	"Barnabas.Dialogue.Marriage.NoBed_0": "I don't mind having no bed but...isn't it awfully hard for your back?",
	"Barnabas.Dialogue.Marriage.NoBed_1": "There is a severe lack of beds in this house....should I whip one up real quick?$1",
	"Barnabas.Dialogue.Marriage.NoBed_2": "...hm....there's something off here...last night felt a bit different.",
	"Barnabas.Dialogue.Marriage.NoBed_3": "Is having no bed some sort of statement?",
	
	//AFFECTION DIALOGUE
	"Barnabas.Dialogue.Marriage.Good_0": "%Barnabas is distracted tinkering with some of his tools.#$b#...oh! Hey, @!$1#$b#I was sorting my tools so I know which one I need to replace. Over time they get so worn down that even repairing isn't an option anymore.#$b#I do take good care of them though so they last very long!$1",
	"Barnabas.Dialogue.Marriage.Good_1": "Every morning I wake up and I look at you sleep my heart jsut starts pounding really fast.#$b#I am so happy that we're together, @!$1#$b#I hope that we will stay together no matter what!",
	"Barnabas.Dialogue.Marriage.Good_2": "Every day that I get to spend with you I cherish!#$b#Let's have dinner under the starts tonight, @.$1",
	"Barnabas.Dialogue.Marriage.Good_3": "I stopped by the museum today and saw the kids learning about the ocean.#$b#I really wanted to listen more but I thought that would be weird...#$b#...I'd have so much to tell about the ocean and it's ecosystem tho, hm.",
	"Barnabas.Dialogue.Marriage.Good_4": "I actually sold some of my furniture that I made last week!$1#$b# Here I want you to have this. $action AddMoney 5500",
	"Barnabas.Dialogue.Marriage.Good_5": "Look, look! I made a list of the dishes you liked the most so far, do you think we should try more and see if you like them as well?#$b#I really wanna have you enjoy what I cook but I also wanna make sure that you get enough sustenance for your work!$1",
	"Barnabas.Dialogue.Marriage.Good_6": "Good morning, @! I went ahead and made you something to start the day full of energy! [201]#$b#Make sure to stop by later so I can rejuvenate you with a big smooch, hehe!$1",
	"Barnabas.Dialogue.Marriage.Good_7": "Remember when I found that traffic cone hat?#$b#I found more things to wear and Emily commented eagerly on how unique my style is.#$b#We talked quite a while after that and she invited me to stand model for some of her clothes!$1",
	"Barnabas.Dialogue.Marriage.Good_8": "Today I think I gonna swim back to the island and make a few rounds to see how the others are doing.#$b#It's a lot of resposibility while also having my own family now but I am up for the task!$1",
	"Barnabas.Dialogue.Marriage.Good_9": "A lovely day today for a lovely person such as you!$1#$b#Come here and give me a big smooch, hehe!$1",
	"Barnabas.Dialogue.Marriage.Neutral_0": "Sometimes days go by so slow it feels like you're stuck in thick mud. But that's okay!#$b#In times like these you just step back and take things how they come. It's totally fine to not always feel your best.#$b#And if you feel bad, @, know that I am here for you!$1",
	"Barnabas.Dialogue.Marriage.Neutral_1": "%Barnabas is drenched and as he turns around you see a leech stuck to his arm but he just casually shakes it off.#$b#Oh hey, @! I just got back from a little swim to see how the island is doing.",
	"Barnabas.Dialogue.Marriage.Neutral_2": "Uhhh....I think I forgot where I put the leash of %pet.#$b#Oh, it's gonna be fine, I will just tell %pet to behave while we gom to the island.$1",
	"Barnabas.Dialogue.Marriage.Neutral_3": "I think today is gonna be good. The day already started with you being the first thing I see and how can the day be that bad if you're part of it?$1",
	"Barnabas.Dialogue.Marriage.Neutral_4": "Hm, maybe I will go and collect some things that I can use in my nect projects...been a while since I've done a mixed meadia piece.#$b#%Barnabas is deeply in thoughts, better not disturb him for now.",
	"Barnabas.Dialogue.Marriage.Neutral_5": "%Barnabas gives you a big smooch and smiles with a big grin.#$b#@! I've stocked up on some gems earlier today!#$b#A discovery I made though is that no matter what gem...their luster does not compare to your smile, hehe! Nothing is as pretty as you!$1",
	"Barnabas.Dialogue.Marriage.Neutral_6": "I have a few spare prismatic shards...maybe I will fuse them together in a certain angle so the light gets fractured in a way that makes it as if it moves...hmmmm!",
	"Barnabas.Dialogue.Marriage.Neutral_7": "%pet used me as a bed today.#$b#I was kneeling down to fix the sink in the kitchen and %pet took it as an invite to just flop down on my stomach. I don't really mind but it makes it hard to move and get my tools, haha!",
	"Barnabas.Dialogue.Marriage.Neutral_8": "I took the time to clean your farming tools today. Made sure to sharpen them as well!#$b#Have a great day!$1",
	"Barnabas.Dialogue.Marriage.Bad_0": "%Barnabas looks distracted, it takes more than a few nudges to get his attention.#$b#Ah, oh...it's you, @. Hehe-...hm.$8#$b#Sorry, I think I'm a bit in low spirits today.$8",
	"Barnabas.Dialogue.Marriage.Bad_1": "I sometimes worry if I am good enough of a husband to you, @.$7#$b#...please let me know if something is wrong, okay?$8",
	"Barnabas.Dialogue.Marriage.Bad_2": "@...$7#$b#...$8#$b#...ah. It's nothing. I think It's one of those days.$1#$b#...perhaps I'll just carve some wood today.$8",
	"Barnabas.Dialogue.Marriage.Bad_3": "Hm, mhm...$8#$b#%Barnabas doesn't seem like he wants to talk right now...",
	"Barnabas.Dialogue.Marriage.Bad_4": "Oh, hey...@.#$b#...hm. Hey...oh, I can't channel my usual energetic side today it seems...hey. Just so you know, I will always love you, okay?$8",
	"Barnabas.Dialogue.Marriage.Bad_5": "Ah, hm...it feels my mind keeps wandering off somewhere...sorry.#$b#...I might go and to the beach and, hm, perhaps collect some sand.$7",
	"Barnabas.Dialogue.Marriage.Bad_6": "I know things can be hard sometimes but even when I tell myself that it's okay to show your vulnerable side the moment it does actually happens it jsut feels so bad...$8#$b#Oh...it's okay, @. Just remember I love you, I always will.",
	"Barnabas.Dialogue.Marriage.Bad_7": "I think...ah, nevermind.#$b#%Barnabas looks away, givng you one of his signature smiles.",
	"Barnabas.Dialogue.Marriage.Bad_8": "@...I love you. No matter how hard the day will be or what challenge we face...I want to be the one that will catch you when you fall.#$b#...$8#$b#...I hope you will do the same for me.",
}