{
	//==============================================================================================
	//==== S T R I N G S   F R O M   M A P =========================================================
	//==============================================================================================
	
	//SHOP CLOSED MESSAGE 
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShopClosed": "Looks like Constance isn't around, guess I'll come back later...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CawynShopClosed": "Cawyn seems to be asleep, better not disturb him right now.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MrFeeshShopClosed": "%You hear some wet noises but Mr Feesh appears too occupied to attend to his shop right now.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.WitchesShadowShopClosed": "The Witches Shadow: Nothing....matters.......but maybe....come back...later....I shall attend....to your...needs...",
	
	//MMAP DONT CUT DOWN TREES DIALOGUE
	"VoidWitchCult.CP.TheFishmongerNPC.SeaDude.DontCutDownMyOrchard.1": "Don't cut down the Orchard or you'll make Barnabas sad...",
	"VoidWitchCult.CP.TheFishmongerNPC.SeaDude.DontCutDownMyOrchard.2": "...please don't cut down these trees.",
	
	// FISHMONGER HOME
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.1": "You look into the bin before you...there's something staring back at you at the bottom of it.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.2": "Something is glistening at the bottom of the water...you decide to not ask Constance about it.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.3": "A bunch of fresh fish swimming about. One seems to stare at you though.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.4": "No matter how you look at it...it's still just fish.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.5": "You try to open the hatch but it won't budge...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.6": "There are several snippets of paper and some photos attached to the wall. You take a closer look and notice a familiar looking man on one of the photos.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerShop.7": "There's all kind of things stored in these boxes, among them artifacts, bones and...things you haven't seen before?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FridgeGalore": "You take a peek to see what is in the fridge...some sandwiches, fish fillet and an assorted variety of freshly cut vegetables. There is also a sealed glass container wrapped in some kind of fabric...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.0": "Random:You turn the radio on and catch it in the middle of a song:",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.1": "When you turn the radio on, you catch it in the middle of a song:# '...I  can't believe it's hard just to talk to you...But you don't understand...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.2": "When you turn the radio on, you catch it in the middle of a song:# '...say it ain't so...make me believe we can fix this...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.3": "When you turn the radio on, you catch it in the middle of a song:# '...all those younger days of the past...how I wish they would forever last...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.4": "When you turn the radio on, you catch it in the middle of a song:# '...and I know, yeah I know...two do play this game...I've never felt more stupid...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.5": "When you turn the radio on, you catch it in the middle of a song:# '...now the sun will rise and I know things'll turn out better...I just wonder when it's time...when the day I know of is almost over...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.6": "When you turn the radio on, you catch it in the middle of a song:# '...take a moment to think about...all those fallen pieces...let's pick them up and mend them once more...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.7": "When you turn the radio on, you catch it in the middle of a song:# '...dark and cloudy days, but all I do is wait...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.RadioGaga.8": "When you turn the radio on, you catch it in the middle of a song:# 'Doch wat du deihst, do mit Bedacht...To rechter Tied si op din Wacht...Vergitt ook Gott nich un sin Wort...Doh jeden Minschen recht an Boord...'",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.1": "A crate full of freshly harvested Flowers. It seems as if they were put there with the purpose of making something out of them.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.2": "The faint scent of smoked fish emenates from the inside. It already has a few dents here and there but seems well maintained and used.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.3": "The crate is filled with an arrangement of beach forage and the likes. It was carefully put there, not thoughtlessly tossed aside.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.4": "The sweet scent of fruit wine mixes with the flowers frangrance atop the kegs.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.5": "Delicate apparatus use to create all kinds of different oils. They are well taken care of.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.6": "Presses used for different occassions. There are crates shoved under them filled with cleaning supplies and other tidbits used for the pressing.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.7": "Upon opening the drawers of the night stands a whole assortments of odd things are revealed. They seem to be small trinkets from Constance's travels around the world.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.8": "The bed is in the shape of a boat. Inside a boat...the only thing to make it worse would be to put a small toy boat into the bed.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.9": "Toys for the ferrets? Bobbers? Who knows! Either way of it's original use the ferrets will play with it without hesitation.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.10": "Some notes that are mostly scribbled out. They seem to mention floral arrangements and how to make them...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.11": "These drawers are filled with trinkets and the likes as well. Small cups, figurines and other little things one usually would find in random shops when travelling and thinking 'Oh, that would be a fun thing to take home.'.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.12": "The boxes atop the drawers are sealed shut. The old dusty smell hints at them sitting there for quite a while. What hidden gems could be in there one wonders...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.FishmongerLowerDeck.13": "Another set of drawers. Another bunch of trinke-....or not? This one is actually filled with clothes! Hats, sweaters...actually clothes one would usually find. It's probably not a good idea to continue rummaging it or else...",
	"MEEP.InteractiveTile.0": "It's a picture of Constance and Willy taking a fishing trip together...",
	
	// LOST ISLAND
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIslandRadio.1": "An odd gurgling sound is audiable through the radio albeit almost drowned out by the environmental noise of the surroundings. It speaks in a language long forgotten...lamenting about goneby eras and their people...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIslandRadio.2": "An odd gurgling sound is audiable through the radio albeit almost drowned out by the environmental noise of the surroundings. The female voice heard sounds familiar yet oddly distorted at the same time. It talks about fishing and different kinds of lure. There is silence for a moment and then only a loud THUD is audible before the radio goes silent again...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIslandRadio.3": "An odd gurgling sound is audiable through the radio albeit almost drowned out by the environmental noise of the surroundings. It keeps repeating the same sentence over and over...got lost, how do I get home? ...got lost, how do I get home? ...got lost, how do I get home? ...got lost, how do I get home? ...got lost, how do I get home?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIslandRadio.4": "An odd gurgling sound is audiable through the radio albeit almost drowned out by the environmental noise of the surroundings. The voice of a boy asked someone referred to as his sister about if they'd see the other person again. There is no answer. Instead a faint weeping can be heard...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.2": "There are some old torn letters posted to the board, most is faded out over time but a few words are still readable: ....child....lost at sea.....given treatment...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.3": "Among the rustling leaves of plants and flowers someone had found their little sanctuary with candles and refreshments...it seems well taken care of.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.4": "Planters appear to be blocking the way...seems like you'll have to wait for a later time to pass...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.5": "A mermaid is singing her silent songs to an empty audience. Her sullen voice singing of times long lost.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.6": "A giant clam shell and a mermaid sitting in it...she seems to invite you to sit with her...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.7": "Over time one notices some carvings in certain palm trees on the island. Someone must've had a lot of free time...",
	
	//  MERMAID HOME
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.1": "There are many books about aquatic life. Quite a few personal notes were added to a lot of them.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.2": "Books about nature, magic and other things are in this bookshelf, neatly sorted. A few are so old it feels like they'd desintegrate if you were to open them...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.3": "A tub of water. There's something about it that seems off, but one can't put a finger on what it could be.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.4": "The fireplace is decorated with colorful seeds and twine crafted into some sort of garland. The scent is sweet and reminds of florat bouquets.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.5": "A handmade model ship. The craftmenship of it shows careful consideration of it's delicate materials. Whoever made this ship surely enjoyed crafting it.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.6": "All natural cleaners in old glass bottles, sea shells and a few other things neatly sorted away.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.7": "The scent of freshly picked fruits and salty fish is coming from the fridge upon opnening. It is filled with a variety of crops and forages.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.8": "The oven contains some leftovers from a previous meal. It still seems to radiate a faint heat hinting at the last meal not having been too long ago...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.9": "The desk contains a varity of bottles for tinctures, perfume and more. The intricate designs of these bottles show they were handmade.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.MermaidHouse.10": "A bed crafted from special wood. It's cushions feel soft and silky...great for a calm sleep.",
	
	// COOLGAL HOME
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.1": "You open the door and are greeted with a bunch of pots and pans. Cleaned. Guess that's one way to store them with a lack of space.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.2": "The fridge is stuffed to the brim with an assortment of foods. Fresh vegetables and fruits alongside some unhealthier choices. Everyone wants a treat to indulge in once in a while, right?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.3": "Every attempt in trying to open these barrels fail...there's some odd noises coming from inside though...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.4": "An interesting choice to display so casually...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.5": "Filled to the top with books of various topics....fashion, alternative lifestyle, foraging, fishing...'how to disappear completely'...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.6": "The computer is decorated with all kinds of stickers and paint blobs...yet overall it's an oddly neat working environment.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.CoolGalHome.7": "A stol- er...permanently borrowed Joja cart that's been painted...more or less...",
	
	// PIRATELAD HOME
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.1": "The fish smocker is heavily used. It has seen better days but it's clear it is well maintained.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.2": "A fresh pint  of beer is on the counter, it's foaming crown mocking you.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.3": "The drawers have an assortment of cutlery and such. ...and a seemingly endless amount of different types of knives.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.4": "There's a lot of fish in the fridge. The notes on the door have different tips and tricks on how to stay healthy on a long trip to the sea...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.5": "Books about sailing, pludering, boats and the likes. Oddly enough a few books about botany and flower language are mixed in there as well.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.6": "An old bottle, sealed with a skull ornament. There's something inside but the bottle cannot be opened.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.7": "Some well maintained leather boots sit atop a dresser. A peek into the dresser could make you a head shorter though...beware.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.8": "Among decorations there are some notes stuck to the wall indicating some of the favorited things...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.PirateLadHome.9": "A thick woolen blanket for the cold nights on the sea.",
	
	//SEADUDE HOME
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.1": "This seems to be where Barnabas sleeps. It's a huge anemone with a fish shaped pillow...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.2": "The chest is hand-made and shows different kind of fish carvings. However, it is locked so the contents remain unknown.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.3": "The bookshelf contains quite a few books. It feels like a continuation of what Calliope had in hers. Barnabas appears to be an avid reader.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.4": "Oddly enough the cultery drawer has tools mixed in for wood-work. At least they're pretty clean...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.5": "The cabinet under the sink is stuffed full of oils and other liquids used for wood carving and similar tasks. Barnabas' hobby has practically spilled into every nook and cranny of his home.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.6": "The fridge is stuffed to the brim with fruits and veggies. There is the occassional frshly caught fish shoved in there as well.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.7": "More books were shoved into this cabinet. Among the many books is an entire extensive encyyclopedia series of plants.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.8": "It almost looks as if the log was torn right out of the ground...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.9": "A finished statue of a mermaid, carved from stone. The attention to detail is incredible.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeHome.10": "Some sort of workbench. It contains tools and some wood scraps, stone pieces and other doodads.",
	
	//SEADUDE CAVE
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeCave.1": "The bush is in full bloom...seems like being in a cave isn't impacting it's vitality.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeCave.2": "The barrel is filled with random things like ropes, planks, ores...all kind of things Barnabas uses in his work.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeCave.3": "A pile of oddly colored lumber.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.SeaDudeCave.4": "Another big stump...how has Barnabas gotten this one down here?",
	
	//Lost Island Orchard
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.1": "The intricate design shows attention to detail and the laqueur hints at a deeper understanding on how to preserve the wood for a long time without taking away from it's natural features.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.2": "Soft buzzing comes from within the hives...it almost seems like a song.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.3": "A sweet floral scent is coming from the hives. Upon closer inspection one can see how well taken care of they are.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.4": "A small crop field that is carefully tended to. It appears to be some sort of community garden.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.5": "Small, plant-like people peek out from behind the door and look curiously around. Upon seeingg you the door quickly closes as they shyly hide away.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.6": "A plant-person comes out of the house and hands you something. It's a flower bud!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.7": "The door is locked but there's soft humming coming from inside.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.8": "All houses appear to be similar, the craftmanship is the same as well showing that one person must've built them all.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.9": "There is a name carved into the side of the house as if it was signed. Sadly it is not readable.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.10": "The side of the house is covered in crude paintings. It shows a big shark-like mermaid with a toothy grin among other things.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.11": "Despite knocking at the door there is no reaction.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Orchard.12": "The door is slightly open, through the crack one sees how a plant-person is taking care of the petals of another, smaller, plant-person.",
	
	//Lost Island Enchanted Forest
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.1": "<-- Beach! #There's several other symbols messily painted onto the signs unclear on what they could mean....",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.2": "A lot of barrels and crates are scattered around this area. Most of them contain something, some with a fruity, sweet scent while others make odd splashing sounds...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.3": "Some sort of cart filled with flowers. There's all kind of colorful ones neatly sorted into it.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.4": "A small field of crops that someone is tending to. It is freshly watered.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.5": "These barrels look like any other in this area but upon closer inspection something appears to be seeping through it...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.6": "Stuffed toys sitting on a picnic blanket. A clear sign of age is visible, yet they're not dirty at all.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.7": "The door won't budge. Looking through the window shows clear signs of abandonment inside, yet it is not falling apart completely as if frozen in time.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.8": "There's a boat nearby, still actively used by someone judging by the lack of growth of algea and such on the bottom of it.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.9": "The flowers and decorations are neatly put around, showing dedication and care in arrangging them.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.10": "Local ingredients were used to make these decorations, they have the same handwriting as most of the other crafted things around the island, hinting at the same person havingg made them.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.11": "Big floral arrangements are put around having an awful similarity with those put around graves.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.12": "A huge statue of a merman is sitting on top of this small island. The size, fins and general skin pattern hint at it being a shark merman, yet it's size, albeit maybe just increased by choice to have a bigger statue, could hint at something more ancient...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.13": "Looking closer there in an engraving at the bottom of the statue: #Gone from our sight, but never from our hearts. #Llyr, devoted father, loving husband and kind leader. #May your soul forever roam the ocean.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.14": "In between the floral arrangements small tidbits can be found ranging from jewellery to shells and other things that could be seen as sentimental pieces.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.15": "A very detailed junimo plush is sitting atop the picnic blanket. Wait, did it's eyes just move?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.16": "Opening the barrels reveals a backlog of fibre and other similar things used for building. Though there seems to be someting pearlesque glistening at the bottom...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.17": "The toy boat has little hand-carved plant people pirates in it, some of them are scattered around in the sand.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Forest.18": "Amids the sand that was used to built a sand castle is a small can filled not jsut with said sand but small pennies and shells as well. Whoever plays here likes small trinkets.",
	
	//Lost Island Forsaken Cove
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.1": "Everytime... my legacy grows stronger... this 'me' gets smaller.... let them florish.... I am long gone... I am sorry.... I departed too early...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.2": "...Regret... if I could've just been-... Ah, nevermind... an afterthought... to be free...what pipedream...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.3": "...Don't...weep... the future is both...promising and terrifying...at the same time... rejoice...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.4": "Earth shattering emotions... overcome with grief... live on... my children...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.5": "Ah... to feel the waves of the sea again... I dream... of an endless ocean... where my heart lies... but I am stuck... cursed to see them all wither away...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.6": "I watch... I cry... I cannot be heard...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.7": "...what paradise... the sacrifice... had to be done... I could not... watch them suffer... forgive me...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.8": "I am sorry... I hope... one day... they will understand... thank you... for coming into...my life...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.9": "46 69 6E 64 20 6D 79 20 68 65 61 72 74 20 69 6E 20 74 68 65 20 64 65 70 74 68 73 20 6F 66 20 74 68 65 20 6F 63 65 61 6E 20 61 6E 64 20 64 65 73 74 72 6F 79 20 69 74 2E 20 45 6E 64 20 74 68 65 20 6C 61 73 74 20 66 6C 69 63 6B 65 72 20 6F 66 20 6D 79 20 6C 69 66 65 2E",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.CoveShadow.10": "Begone... the living should not... be here... prosper... and be kind...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Cove.1": "",
	
	//Cliffside Library
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.1": "'Our King, martyred.'^The painting shows what appears to be a muscular merman. It is painted in a realistic style thought a crown of thorns was crudely painted onto it. The look that merman displayes is somber yet kind...#Hm...the person in the painting looks just like the statue in the forest...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.2": "'Waiting for the day to come.'^A simple painting that is rather abstract in it's paint strokes and style. It shows what seems to be a figure on the beach looking longingly at the horizon.#What where the thought of this artist behind drawing it? What day were they waiting for...?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.3": "'The gaze of the depths.'^Another abstract piece though this one has a mix of colors creating  an effect of staring right into the deepest pits of the ocean. Blobs of flourescent colors resembling eyes staring right onto the onlooker in an eery way...#...creepy. Though somehow it also has a somber undertone...are we the prey or is this the look of someone warning you to run?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.4": "'My heart, profound.'^An oddly realistic heart in a serene underwater environment. Upon closer inspections it's visible how the area where the heart is has been painted over several times. It's as if the true nature of it was hidden from the viewers eyes.#Wait...tracing the outline of the paint...whatever was painted under it looks more like a festering mass than a heart...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.5": "'DaD!'^A simple picture drawn by a child, the paper tattered but clearly well-preserved.#...how cute.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.6": "'To you, eternally.'^Lush Foliage and flowers painted in realistic style. The choice of hues hint at a somber undertone and a bittersweet ending...#...it feels as if you could almost touch those leaves...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.7": "'Fluvial grounds.'^Pastel colors reminding of happy memories...a softly painted beach that invites one for a leisurely stroll.#Ah...it's like the beaches here on the island.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.8": "'Baby, the stars shine bright.'^An abstract painting of the midnight sky. The warm soft colors give a stark contrast to the helplessly endlessness of the universe.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.9": "The story in this book talks about a ship lost at sea. Stuck inside what seems to be a different realm  the vessel struggled to stay afloat, tall waves thrashing against it with full force.^Odd apparitions looming over it, trying to speed up the ships demise.^When everything was thought to be futile, something massive came from under the sea, rising above and revealing it's massive size...a shark-like merman...#...ah, this seems to be a collection of many smaller stories, all talking about a certain merman...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.10": "'How to make any plant grow in 5 easy steps.'^Strange, this book says it will show you how to be a good gardener but it reads more like some sort of ritualistic any-wish-can-come-true kind of scam. Why is this in a library?#Wait...there are personal comments written on several pages indicating how to improve upon these rituals...?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.11": "'Kaleidoscope of emotional turmoil'^A book about finding oneself again after losing something precious...there is a note left in the book, however, it is too tattered to be read...^Though...the only things one can make out are 'forsaken' and something about a futile sacrifice...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.12": "A childrens book talking about the wonders of the world.^It teaches about openness and positivity, a world where people can gather together and fully understand each other.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.13": "A book about life and your duty to decide on what's best for everyone. It reads more as a bittersweet memoire instead of seeing things from an objective point of view.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.14": "The book picked looks old and torn, upon opening it all pages scatter around the floor...#...great, better pick them up before someone notices...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.15": "The story of two lovers that aren't meant to be. Coming from different worlds they fell in love and wanted to run away yet societies pressure is what got to them.^Ones sacrifice was not enough to calm the waves of progress however...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.16": "A little note falls out when you reach for a book:#Do not trust what lies hidden in the dark. It's festing core is what binds us together, do not let him take it...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.17": "'The colorful world of Junimos'^The book talks about the little forest spirits and how many different ones there actually are.#They seem much more complicated than first assumed, huh.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.18": "First there was the void. It had nothing yet was everything at the same time. It moved and forth sprung existence, from time and space to chaos and order....everything started so sudden.^Yoba knows, yet closes their eyes to the truth.^Everything has their place in the universe, even if it's just meant to die.#Wow, this books heavy topic is a contrast to the more colorful books around it. What even is this odd creation story?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.19": "This book only contains pictures. Drawn in a rather scientific way it's flora and fauna from different perspectives.^On the last page there are some black and white photos stuffed in...#...these photos show different locations on this island, interesting.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.20": "'The wonders of ferrets and how to take care of one'#Huh, this book is oddly interesting! It goes really in-depths into how to take care of a ferret and keep it entertained.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.21": "The book you picked is bound in dark leather, feeling oddly warm to the touch.^It's quiet, too quiet...you can hear silent whispers is a language you do not understand-#...You look at your hand and it's empty...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.22": "The books in this corner all contain some sort of recipe collections.^ Cooking, crafting, knitting a 5 foot long sweater for your favorite merman-...#Huh, wait...what?",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.23": "Several jars and bottles are contained in this cabinet, one would think they're cleaners of some sorts but it is unclear as what is written on the containers is not in any human language.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.24": "Looking into the fridge reveals a wild assortment of things:^jars filled with various liquids, containers with what seems to be something....wriggling...^It's stuffed to the brim but mostly with what looks like ingredients for spells instead of food.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.25": "The small kitchen is used as partly a storage room. Some barrels containing unknown materials are shoved into a corner alongside firewood and a book that was forgotten to be put back on the shelf.#'Kitchen Witchery'^777 ways on how to fill ones life with magical moments while preparing food.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.26": "I forgot where this is, let me know if you find it lol",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.27": "Exibit #0001 -- King Llyr's Coral Harness#Found in the forest of this island after the King had perished.^A cluster of sturdy corals fused together that were seen worn by the King around his waist.",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.28": "The board has a varity of papers and flyers attached to it ranging from general infos from the library over to random notes left by visitors.^There is a note stating an urgent need for some fresh iridium bars for uh...personal use?#Huh, what is 'fresh' supposed to mean in this context? Oh, the note is singed with a 'B.'...",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.29": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.30": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.31": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.32": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.33": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.34": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.35": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.36": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.37": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.38": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.39": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.40": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.41": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.42": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.43": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.44": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.45": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.46": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.47": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.48": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.49": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.50": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.51": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.52": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.53": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.54": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.55": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.56": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.57": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.58": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.59": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.60": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.61": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.62": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.63": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.64": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.65": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.66": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.67": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.68": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.69": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.70": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.71": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.72": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.73": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.74": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.75": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.76": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.77": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.78": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.79": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.80": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.81": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.82": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.83": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.84": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.85": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.86": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.87": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.88": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.89": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.90": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.91": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.92": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.93": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.94": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.95": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.96": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.97": "This is a library test, hello!",
	"VoidWitchCult.CP.TheFishmongerNPC.Strings.LostIsland.Library.98": "'What is a sandwich?' -- The philosophies of what counts as a sandwich and what does not.^In this book scholars talk about the eternal dilemma where a sandwich starts and where it truly ends and why a steak between two pizzas may or may not be counted as one.",
}